In [1]:
import pandas as pd

In [2]:
men_2004 = pd.read_csv('../../Data/men2004.csv')

In [3]:
men_2004

                       Athlete  Medals
0              PHELPS, Michael       8
1                  THORPE, Ian       4
2             SCHOEMAN, Roland       3
3               PEIRSOL, Aaron       3
4                 CROCKER, Ian       3
5             KITAJIMA, Kosuke       3
6              HANSEN, Brendan       3
7   VAN DEN HOOGENBAND, Pieter       3
8               HACKETT, Grant       3
9               MORITA, Tomomi       2
10                LEZAK, Jason       2
11               ROGAN, Markus       2
12               KELLER, Klete       2
13              HALL, Gary Jr.       2
14                LOCHTE, Ryan       2
15                WALKER, Neil       2
16           YAMAMOTO, Takashi       2
17          SPRENGER, Nicholas       1
18          OKUMURA, Yoshihiro       1
19              PARRY, Stephen       1
20               PEARSON, Todd       1
21              ZASTROW, Mitja       1
22          PELLICIARI, Matteo       1
23              WOODWARD, Gabe       1
24            SERDINOV, Andriy       1
25                 VENDT, Erik       1
26      ROSOLINO, Massimiliano       1
27        VEENS, Mark Hermanus       1
28            RUPPRATH, Thomas       1
29           VANDERKAAY, Peter       1
30            TOWNSEND, Darian       1
31              STEVENS, Craig       1
32              NEETHLING, Ryk       1
33              BOVELL, George       1
34                MEEUW, Helge       1
35        FLOREA, Razvan Ionut       1
36       CAPPELLAZZO, Federico       1
37             CERCATO, Simone       1
38                CONRAD, Lars       1
39                CSEH, Laszlo       1
40               DAVIES, David       1
41              DRAGANJA, Duje       1
42            DRIESEN, Steffen       1
43             DUBOSCQ, Hugues       1
44                DUSING, Nate       1
45               FERNS, Lyndon       1
46              GANGLOFF, Mark       1
47           MATKOVICH, Antony       1
48            GOLDBLATT, Scott       1
49              GYURTA, Daniel       1
50              JENSEN, Larsen       1
51             KENKHUIS, Johan       1
52                KETCHUM, Dan       1
53               KLIM, Michael       1
54          KRAYZELBURG, Lenny       1
55                KRUPPA, Jens       1
56         BREMBILLA, Emiliano       1
57            MAGNINI, Filippo       1
58         ZWERING, Klaas-Erik       1

In [3]:
men_2008 = pd.read_csv('men2008.csv')

In [5]:
men_2008

                Athlete  Medals
0       PHELPS, Michael       8
1          LOCHTE, Ryan       4
2        BERNARD, Alain       3
3       SULLIVAN, Eamon       3
4   LAUTERSTEIN, Andrew       3
..                  ...     ...
57     LAGUNOV, Evgeniy       1
58        BERENS, Ricky       1
59         LURZ, Thomas       1
60      MALLET, Gregory       1
61           ZHANG, Lin       1

[62 rows x 2 columns]

# We can use append method
Parameters: other = means the other dataframe to append
ignore_index = means to ignore the index of the other dataframe

In [6]:
men_2004._append(other=men_2008, ignore_index=True)

              Athlete  Medals
0     PHELPS, Michael       8
1         THORPE, Ian       4
2    SCHOEMAN, Roland       3
3      PEIRSOL, Aaron       3
4        CROCKER, Ian       3
..                ...     ...
116  LAGUNOV, Evgeniy       1
117     BERENS, Ricky       1
118      LURZ, Thomas       1
119   MALLET, Gregory       1
120        ZHANG, Lin       1

[121 rows x 2 columns]

# Or we can use concat method, this method is more flexible and can concat multiple data

In [7]:
pd.concat([men_2004, men_2008], ignore_index=True)

              Athlete  Medals
0     PHELPS, Michael       8
1         THORPE, Ian       4
2    SCHOEMAN, Roland       3
3      PEIRSOL, Aaron       3
4        CROCKER, Ian       3
..                ...     ...
116  LAGUNOV, Evgeniy       1
117     BERENS, Ricky       1
118      LURZ, Thomas       1
119   MALLET, Gregory       1
120        ZHANG, Lin       1

[121 rows x 2 columns]

Parameters: 
keys = means to add a 2 keys index to the dataframe, this is useful to identify the dataframes
names = means to add a name to the keys index

In [9]:
men = pd.concat([men_2004, men_2008], ignore_index=False, keys=[2004, 2008], names=['Year'])

In [11]:
men

                  Athlete  Medals
Year
2004 0    PHELPS, Michael       8
     1        THORPE, Ian       4
     2   SCHOEMAN, Roland       3
     3     PEIRSOL, Aaron       3
     4       CROCKER, Ian       3
...                   ...     ...
2008 57  LAGUNOV, Evgeniy       1
     58     BERENS, Ricky       1
     59      LURZ, Thomas       1
     60   MALLET, Gregory       1
     61        ZHANG, Lin       1

[121 rows x 2 columns]

We reset index because we don't need the keys index and drop the level because we don't need the level_1 column

In [13]:
men.reset_index().drop(columns='level_1')

     Year           Athlete  Medals
0    2004   PHELPS, Michael       8
1    2004       THORPE, Ian       4
2    2004  SCHOEMAN, Roland       3
3    2004    PEIRSOL, Aaron       3
4    2004      CROCKER, Ian       3
..    ...               ...     ...
116  2008  LAGUNOV, Evgeniy       1
117  2008     BERENS, Ricky       1
118  2008      LURZ, Thomas       1
119  2008   MALLET, Gregory       1
120  2008        ZHANG, Lin       1

[121 rows x 3 columns]

In [4]:
men_2004.head()

            Athlete  Medals
0   PHELPS, Michael       8
1       THORPE, Ian       4
2  SCHOEMAN, Roland       3
3    PEIRSOL, Aaron       3
4      CROCKER, Ian       3

In [5]:
men_2008.head()

               Athlete  Medals
0      PHELPS, Michael       8
1         LOCHTE, Ryan       4
2       BERNARD, Alain       3
3      SULLIVAN, Eamon       3
4  LAUTERSTEIN, Andrew       3

- We rename the columns and add a new column

In [8]:
men_2004.columns = ["Name", "Medal"]

In [10]:
men_2004["Success"] = "yes"

In [11]:
men_2004.head()

               Name  Medal Success
0   PHELPS, Michael      8     yes
1       THORPE, Ian      4     yes
2  SCHOEMAN, Roland      3     yes
3    PEIRSOL, Aaron      3     yes
4      CROCKER, Ian      3     yes

## When  we concat the dataframes, the columns are aligned by the column names. If a column is not present in one of the dataframes, the value is NaN

In [16]:
data_concat = pd.concat(
    [men_2004, men_2008], ignore_index=False, keys=[2004, 2008], names=['Year']
)

In [18]:
data_concat

                     Name  Medal Success           Athlete  Medals
Year
2004 0    PHELPS, Michael    8.0     yes               NaN     NaN
     1        THORPE, Ian    4.0     yes               NaN     NaN
     2   SCHOEMAN, Roland    3.0     yes               NaN     NaN
     3     PEIRSOL, Aaron    3.0     yes               NaN     NaN
     4       CROCKER, Ian    3.0     yes               NaN     NaN
...                   ...    ...     ...               ...     ...
2008 57               NaN    NaN     NaN  LAGUNOV, Evgeniy     1.0
     58               NaN    NaN     NaN     BERENS, Ricky     1.0
     59               NaN    NaN     NaN      LURZ, Thomas     1.0
     60               NaN    NaN     NaN   MALLET, Gregory     1.0
     61               NaN    NaN     NaN        ZHANG, Lin     1.0

[121 rows x 5 columns]

In [17]:
data_concat.tail()

        Name  Medal Success           Athlete  Medals
Year
2008 57  NaN    NaN     NaN  LAGUNOV, Evgeniy     1.0
     58  NaN    NaN     NaN     BERENS, Ricky     1.0
     59  NaN    NaN     NaN      LURZ, Thomas     1.0
     60  NaN    NaN     NaN   MALLET, Gregory     1.0
     61  NaN    NaN     NaN        ZHANG, Lin     1.0